import { sql } from "./index";
import { sendMessage } from "./utils/sendMessage";

// This file just decide and handle the commands to response with the correct msg.

export const handleCommand = async (chat_id: string, command: string) => {
  switch (command) {
    case "/start":
      await sendMessage(
        chat_id,
        `*أهلاً بك في مستشار AI* 🏛️⚖️

              أنا مساعدك القانوني الذكي المتخصص في *القوانين السودانية*. يمكنني مساعدتك في فهم المواد القانونية وتبسيط الإجراءات القضائية.

              💡 *ماذا يمكنني أن أفعل؟*
              • شرح مواد قانون الأحوال الشخصية، الجنائي، والعمل.
              • تقديم إرشادات حول الإجراءات القانونية العامة.
              • تلخيص سياق مشكلتك لتقديم نصيحة مركزة.

              استخدم قائمة الأوامر (/) لاستكشاف المزيد، أو اطرح سؤالك مباشرة الآن!`,
      );
      break;
    case "/clear":
      await sql`UPDATE user_memories SET summary = 'No history found', updated_at = NOW() WHERE chat_id = ${chat_id}`;
      await sendMessage(
        chat_id,
        `تم مسح سجل الرسائل، سأفتح معك الآن صفحة جديدة ✅`,
      );
      break;
    case "/about":
      await sendMessage(
        chat_id,
        `  *مستشار AI | Mustashar AI* 🏛️

            مساعد ذكي متخصص في القوانين والتشريعات السودانية، يهدف إلى تبسيط الوصول للمعلومة القانونية باستخدام الذكاء الاصطناعي.

            • *الإصدار:* 2.0 (تجريبي)
            • *النطاق:* الأحوال الشخصية، الجنائي، العمل، والتشريعات العامة.
            • *المطور:* [اسم الفريق أو المطور]`,
      );
      break;
    case "/help":
      await sendMessage(
        chat_id,
        ` *كيفية استخدام المستشار* 💡

              للحصول على أفضل نتيجة قانونية، يرجى اتباع الآتي:

              1️⃣ *الوضوح:* اطرح سؤالك بشكل مباشر (مثلاً: ما هي إجراءات تسجيل الأراضي؟).
              2️⃣ *الاختصار:* ركز على الوقائع القانونية وتجنب التفاصيل الشخصية.
              3️⃣ *البداية الجديدة:* استخدم أمر /clean عند الانتقال لموضوع جديد.
              4️⃣ *اللغة:* أتفاعل معك بالفصحى أو العامية السودانية.
      `,
      );
      break;
    case "/sources":
      await sendMessage(chat_id, `
         قائمة المصادر التي يستعين بها مستشار :
         
         `);
      break;
    case "/disclaimer":
      await sendMessage(
        chat_id,
        `
       *تنبيه قانوني هام*

              جميع الإجابات المقدمة هي لأغراض التوعية القانونية والمعلومات العامة فقط.
              • هذا البوت *ليس محامياً* ولا يغني عن استشارة المختصين.
              • لا تترتب على هذه الإجابات أي مسؤولية قانونية.
              • يُنصح دائماً بمراجعة محامٍ ممارس قبل اتخاذ إجراء رسمي.`,
      );
      break;
  }
};
